10/data/attachments/ca2bdac1fea03e46.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d439e020-d2e4-47bd-9aac-ecc0b42b9abd</nif:username>
            <nif:friendToBeAdded>Stephanie_may_Friend_66392_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>